<?php
return [
    // 财务请求码
    'FINANCE' => [
        'A0650' => 'K0650',// 正价商品快捷支付
        'A0651' => 'K0651',// 特价商品快捷支付
        'A0652' => 'K0652',// 特价商品寄售完毕
        'A0690' => 'K0690',// 正品订单余额支付
        'A0699' => 'K0699',// 闪购订单余额支付
        'A0692' => 'K0692',// 闪购订单金币支付入场券
        'A0700' => 'K0700',// 提现快捷代付
        'A0800' => 'K0800',// 用户迁移余额转账
        'A0810' => 'K0810',// 用户迁移积分转账
        'A0710' => 'K0710',// 余额退还
        'A0660' => 'K0660',// 商品微信支付
        'A0688' => 'K0688',// 商品支付分润
        'A0850' => 'K0850',// 活动商品无卡支付
        'A0860' => 'K0860',// 活动商品微信支付
        'A0880' => 'K0880',// 活动商品微信支付
        'A0870' => 'K0870',// 收款微信支付
        'A0100' => 'K0100',// 余额充值微信支付
        'A0618' => 'K0618',// 土地租赁分润
        'A0628' => 'K0628',// 农产品分润
        'A0110' => 'K0110',// 余额充值,
        'A0190' => 'K0190',// 自动领取收益
        'A0799' => 'K0799',// 余额提现（ETH新增）
        'A0199' => 'K0199',// 余额充值（ETH新增）
        'A0760' => 'K0760',// 余额充值（ETH新增）
        'A0701' => 'K0701',// 金币充值（ETH新增）
        'A0769' => 'K0769',// 中奖分红（ETH新增）
        'A0500' => 'K0500',// 静态分红（ETH新增）
        'A0890' => 'K0890',// 活动商品微信支付(好运1+1)
        'A1200' => 'K1200',// 方案计划保证金支付,

        'A1950' => 'K1950',//打赏
        'A1960' => 'K1960',//起哄
        'A1970' => 'K1970',//鼓励
        'A1850' => 'K1850',//会员升级
        'A1860' => 'K1860',//会员充值
        'A0780' => 'K0780',//系统初始化呖咕积分1000W
        'A1100' => 'K1100',//任务保证金退还
        'A1110' => 'K1110',//任务成功奖励分配
        'A1190' => 'K1190',//任务失败监督分配
    ],
    //请求码 词典
    'DICT' => [
        'A0650' => ['msg' => '正价商品快捷支付'],
        'A0651' => ['msg' => '特价商品快捷支付'],
        'A0652' => ['msg' => '特价商品寄售完毕'],
        'A0690' => ['msg' => '正品订单余额支付'],
        'A0699' => ['msg' => '闪购订单余额支付'],
        'A0692' => ['msg' => '闪购订单金币入场券'],
        'A0700' => ['msg' => '提现快捷代付'],
        'A0800' => ['msg' => '用户迁移余额转账'],
        'A0810' => ['msg' => '用户迁移积分转账'],
        'A0710' => ['msg' => '余额退还'],
        'A0660' => ['msg' => '商品微信支付'],
        'A0860' => ['msg' => '活动商品微信支付'],
        'A0870' => ['msg' => '司机城际订单微信支付'],
        'A0880' => ['msg' => '乘客顺风车订单微信支付预付款'],
        'A0100' => ['msg' => '余额充值微信支付'],
        'A0618' => ['msg' => '土地租赁分润'],
        'A0628' => ['msg' => '农产品分润'],
        'A0110' => ['msg' => '余额充值'],
        'A1200' => ['msg' => '方案计划保证金支付'],

        'A1950' => ['msg' => '方案计划 打赏'],//打赏
        'A1960' => ['msg' => '方案计划 起哄'],//起哄
        'A1970' => ['msg' => '方案计划 鼓励'],//鼓励
        'A1850' => ['msg' => '方案计划 会员升级'],//会员升级
        'A1860' => ['msg' => '方案计划 会员充值'],//会员充值
        'A0780' => ['msg' => '方案计划 系统初始化呖咕积分'],//系统初始化呖咕积分1000W
        'A1100' => ['msg' => '方案计划 任务保证金退还'],//任务保证金退还
        'A1110' => ['msg' => '方案计划 任务成功奖励分配'],//任务成功奖励分配
        'A1190' => ['msg' => '方案计划 任务失败监督分配'],//任务失败监督分配
    ],
    // 通道请求码
    'CHANNEL' => [
        // 余额
        '10' => 'A0100',
        // 红包
        '60' => 'A0110',
        // 冻结
        '30' => 'A0120',
        'share' => ''
    ],
    // 会员升级编码
    'USER_CODE' => [
        'A0130' => 'P1201',
        'A0131' => 'P1301',
        'A0132' => 'P1311',
        'A0230' => 'P1201',
        'A0231' => 'P1301',
        'A0233' => 'P1311',
        'A0140' => 'P1401',
        'A0150' => 'P1501',
        'A0160' => 'P1601',
        'A1140' => 'P1401',
        'A1233' => 'P1301',
        'A2233' => 'P1311',
    ],
    // 升级金额检测
    'MONEY' => [
        'A0230' => '1000',
        'A0231' => '10000',
        'A0233' => '30000',
        'A0140' => '100000',
        'A0150' => '300000',
        'A0160' => '1000000',
        'A1140' => '100000',
        'A1233' => '10000',
        'A2233' => '30000',
    ],
    //PMS等级对应请求码
    'REQUEST_CODE' => [
        'P1201' => 'A0230',
        'P1301' => 'A0231',
        'P1311' => 'A0233',
        'P1401' => 'A0140',
        'P1501' => 'A0150',
        'P1601' => 'A0160',
    ],
    'DEAL'=>[
        'QuickPay'=>'QuickPay',
    ]
];